Tekla.Structures.TeklaStructuresInternal.DelegateProxy
CDelegate remote class proxy.

Tekla.Structures.TeklaStructuresInternal.DelegateProxy.#cctor
Initializes static instance variable.

Tekla.Structures.TeklaStructuresInternal.DelegateProxy.Initialize
Initializes the delegate proxy,

Tekla.Structures.TeklaStructuresInternal.DelegateProxy.Delegate
Gets the singleton CDelegate instance that includes model API methods.

Tekla.Structures.TeklaStructuresInternal.DelegateProxy.DeactivateInterface(System.String)
Deactivate Tekla.Structures.Model interface
Param:
Returns: